{
  "backend/main.mo": "Motoko backend actor managing race history, model stats, and user settings with functions to log race entries, update outcomes, and query user data per Principal.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to source files, components, and test IDs with confidence levels for dashboard stats, model health, strategy modes, and prediction summaries.",
  "frontend-file-summaries.txt": "Pre-existing summaries of all frontend TypeScript/React files including pages, components, and hooks for the GTA betting assistant application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for UI elements like background, foreground, cards, borders, and charts.",
  "frontend/index.html": "HTML entry point for the GTA Betting Assistant application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for dashboard, new bet, log result, history, stats, and settings pages, wrapped in theme provider with session tracking modal.",
  "frontend/src/components/ContenderOddsRow.tsx": "Reusable component for entering odds (1-30) for a single contender with real-time implied probability calculation displayed inline.",
  "frontend/src/components/ContenderProfile.tsx": "Card component displaying detailed statistics for a single contender including win/place/show rates, last 5 finishes, streak, average implied odds, and consistency score.",
  "frontend/src/components/ContextualWarning.tsx": "Alert component displaying contextual warnings for low confidence, high variance, or no value conditions with appropriate icons and messages.",
  "frontend/src/components/FinishingPositionSelector.tsx": "Dropdown selector component for choosing a contender number (1-6) for finishing positions like winner, second, or third place.",
  "frontend/src/components/LastPredictionSummary.tsx": "Displays a summary card of the most recent race prediction, showing recommended contender, implied probability, bet size, outcome status (Won/Placed/Showed/Failed/Pending), and profit/loss. Fetches race history data and calculates results based on race outcomes.",
  "frontend/src/components/Layout.tsx": "Main application layout component providing header with branding, navigation menu (Dashboard, New Bet, Log Result, History, Stats, Settings), and footer with attribution. Uses TanStack Router for navigation and highlights active routes.",
  "frontend/src/components/ModelHealthIndicator.tsx": "Displays a card showing the prediction model's current health status including confidence level (High/Medium/Low) with color-coded badges and recent accuracy percentage. Shows warning message when confidence is low.",
  "frontend/src/components/OddsSummaryPanel.tsx": "Shows a summary card of betting odds including total implied probability and overround percentage. Displays warning alert if total implied probability is abnormal (outside 80-150% range).",
  "frontend/src/components/PredictionResults.tsx": "Displays comprehensive prediction results in a card grid showing recommended contender, predicted win probability, implied odds probability, value edge, confidence level badge, and recommended bet size. Uses color coding for positive/negative values.",
  "frontend/src/components/RaceHistoryEntry.tsx": "Renders a single race history entry card showing date/time, recommended contender, bet size, status badge (Won/Lost/Pending), race result (winner-second-third), and profit/loss. Calculates outcome based on race results.",
  "frontend/src/components/ReasoningPanel.tsx": "Displays a breakdown card of prediction reasoning showing individual signals with their scores and weights in a grid layout. Uses color coding to indicate positive/negative signal contributions.",
  "frontend/src/components/SessionSummaryModal.tsx": "Modal dialog displaying session performance summary including total profit/loss, best and worst performing contenders, and most accurate strategy mode. Shows data in a grid of cards with color-coded profit/loss.",
  "frontend/src/components/SkipRaceRecommendation.tsx": "Displays a destructive alert recommending users skip the current race when no contender shows strong positive expected value.",
  "frontend/src/components/StatCard.tsx": "Reusable card component for displaying a statistic with title, value, optional subtitle, and optional trend indicator (up/down arrow with color coding).",
  "frontend/src/components/StrategyModeDisplay.tsx": "Displays the current active strategy mode (Safe/Balanced/Value/Aggressive) with its description in a card. Fetches user settings to determine active mode.",
  "frontend/src/components/StrategyModeSelector.tsx": "Radio group selector card for choosing betting strategy mode among Safe, Balanced, Value, and Aggressive options, each with descriptive labels explaining the approach.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flows, identity state, and AuthClient lifecycle with configurable options for delegation and idle handling.",
  "frontend/src/hooks/usePrediction.ts": "Hook that calculates race predictions by analyzing odds, historical performance, recent form, and consistency using weighted signals, then applies strategy modes (Safe/Value/Aggressive/Balanced) to recommend contenders with confidence levels and bet sizing.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data including race history, model stats, user settings, race outcomes, and data resets, all using the actor from useActor.",
  "frontend/src/hooks/useSessionTracking.ts": "Hook that monitors race history to detect every 10th completed race and generates session summary statistics including profit/loss, best/worst contenders, and accuracy metrics.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a dark-themed color palette for UI components including primary green accent, background grays, and chart colors.",
  "frontend/src/lib/betting-calculations.ts": "Utility functions for calculating implied probabilities from odds, overround, and dashboard statistics including total profit, ROI, accuracy, and session performance from race history.",
  "frontend/src/lib/contender-calculations.ts": "Functions to calculate detailed contender statistics from race history including win/place/show rates, recent form, streaks, average implied odds, and consistency scores based on position variance.",
  "frontend/src/lib/export-utils.ts": "Utility functions to export race entry data as downloadable JSON or CSV files with formatted headers and timestamp conversion.",
  "frontend/src/lib/utils.ts": "Utility function combining clsx and tailwind-merge for conditional CSS class name composition.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient provider for data fetching and InternetIdentityProvider for authentication.",
  "frontend/src/pages/ContenderStats.tsx": "Displays performance statistics and profiles for all six contenders, calculating stats from race history data.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard showing betting performance metrics (ROI, profit/loss, accuracy), model health indicators, and quick action buttons for navigation.",
  "frontend/src/pages/History.tsx": "Displays complete race history log with export functionality to JSON and CSV formats.",
  "frontend/src/pages/LogRaceResult.tsx": "Form for recording race outcomes (winner, second, third place) for the most recent unfinished race.",
  "frontend/src/pages/NewBet.tsx": "Main betting interface where users enter odds for six contenders, select strategy mode, and receive AI-powered predictions with reasoning.",
  "frontend/src/pages/Settings.tsx": "Configuration page for model parameters (form window, recency weighting, strategy mode) and data reset functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended theme settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file documenting a GTA Online horse betting assistant with adaptive ML prediction engine using four-signal model (market odds, historical performance, recent form, consistency). Tracks existing features including dashboard stats, model health indicators, strategy modes, prediction results, and bet management with local-first storage architecture."
}