{
  "backend/main.mo": "Motoko actor backend that stores per-user race history, model statistics, and settings with functions to log races, update outcomes, and query data.",
  "feature_evidence.json": "Feature evidence report documenting the ContenderOddsRow empty input field modification feature with high confidence.",
  "frontend-file-summaries.txt": "Pre-generated summaries of all frontend TypeScript/React components, pages, hooks, and utilities (truncated in provided content).",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors, including sidebar, chart, and UI component tokens.",
  "frontend/index.html": "HTML entry point for the GTA Betting Assistant React application with root div and module script reference.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with six routes (dashboard, new bet, log result, history, stats, settings), theme provider, and session tracking modal.",
  "frontend/src/components/ContenderOddsRow.tsx": "Odds input component for a single contender that accepts empty string or numeric values (1-30) and displays implied probability only when valid odds are entered.",
  "frontend/src/components/ContenderProfile.tsx": "Card component displaying detailed statistics for a single contender including win/place/show rates, last five finishes, streak, and consistency score.",
  "frontend/src/components/ContextualWarning.tsx": "Alert component displaying warnings for low confidence, high variance, or no value betting conditions with appropriate icons.",
  "frontend/src/components/FinishingPositionSelector.tsx": "Dropdown select component for choosing a contender's finishing position (1-6) with label support.",
  "frontend/src/components/LastPredictionSummary.tsx": "Card component showing the most recent race prediction with recommended contender, probability, bet size, status, and profit/loss calculation.",
  "frontend/src/components/Layout.tsx": "Main layout component with header, navigation menu (Dashboard, New Bet, Log Result, History, Stats, Settings), and footer. Uses TanStack Router for navigation and displays the GTA Betting Assistant branding.",
  "frontend/src/components/ModelHealthIndicator.tsx": "Displays model health metrics including confidence level (High/Medium/Low) and recent accuracy percentage. Shows a warning when confidence is low indicating bet sizes will be reduced.",
  "frontend/src/components/OddsSummaryPanel.tsx": "Shows total implied probability and overround calculations from betting odds. Displays a warning alert if the total implied probability is abnormally high (>150%) or low (<80%).",
  "frontend/src/components/PredictionResults.tsx": "Displays prediction results including recommended contender, predicted/implied probabilities, value edge, confidence level, and recommended bet size in a grid layout.",
  "frontend/src/components/RaceHistoryEntry.tsx": "Renders a single race history entry showing date, recommended contender, bet size, status (Won/Lost/Pending), race result, and profit/loss calculation.",
  "frontend/src/components/ReasoningPanel.tsx": "Displays the model's reasoning breakdown showing individual signals with their scores and weights in a grid layout.",
  "frontend/src/components/SessionSummaryModal.tsx": "Modal dialog showing session summary statistics including profit/loss, best/worst performing contenders, and most accurate betting mode for a set of races.",
  "frontend/src/components/SkipRaceRecommendation.tsx": "Alert component that recommends skipping a race when no contender shows strong positive expected value.",
  "frontend/src/components/StatCard.tsx": "Reusable card component for displaying a statistic with title, value, optional subtitle, and optional trend indicator (up/down arrow).",
  "frontend/src/components/StrategyModeDisplay.tsx": "Displays the current strategy mode (Safe/Balanced/Value/Aggressive) with a description of what that mode optimizes for.",
  "frontend/src/components/StrategyModeSelector.tsx": "Radio group selector for choosing between four betting strategy modes (Safe, Balanced, Value, Aggressive), each with descriptions of their approach.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance, handling both authenticated (with Internet Identity) and anonymous actor creation. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/usePrediction.ts": "Implements betting prediction logic by calculating contender scores using weighted signals (market odds, historical performance, recent form, consistency) and applying strategy modes (Safe, Value, Aggressive, Balanced) to recommend bets.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including race history, model stats, user settings, and race outcomes with automatic cache invalidation.",
  "frontend/src/hooks/useSessionTracking.ts": "Tracks racing session progress and displays summary statistics every 10 completed races, calculating profit/loss and contender performance metrics.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for theming including colors for background, primary, secondary, destructive states, and chart colors in dark mode.",
  "frontend/src/lib/betting-calculations.ts": "Provides utility functions for calculating implied probabilities from odds, overround, and dashboard statistics including profit/loss, ROI, and accuracy from race history.",
  "frontend/src/lib/contender-calculations.ts": "Calculates detailed statistics for individual contenders including win/place/show rates, recent form, streaks, and consistency scores based on historical race data.",
  "frontend/src/lib/export-utils.ts": "Provides functions to export race entry data as downloadable JSON or CSV files with formatted headers and race outcome details.",
  "frontend/src/lib/utils.ts": "Exports a utility function for merging Tailwind CSS class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/ContenderStats.tsx": "Displays a grid of ContenderProfile cards showing performance statistics for all six contenders, with loading and empty states.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page displaying betting statistics (total races, bets, P/L, ROI, accuracy), model health indicators, strategy mode, last prediction summary, and quick action buttons for navigation. Fetches race history and model stats to calculate and render performance metrics.",
  "frontend/src/pages/History.tsx": "Race history page that displays all logged races in reverse chronological order with export functionality to JSON and CSV formats. Shows loading/empty states when appropriate.",
  "frontend/src/pages/LogRaceResult.tsx": "Page for logging race outcomes by selecting winner, second, and third place finishers for the most recent unfinished race. Validates position uniqueness and updates the race outcome via mutation.",
  "frontend/src/pages/NewBet.tsx": "Bet creation page where users enter odds for 6 contenders, select a strategy mode, and calculate predictions. Displays prediction results, reasoning panels, skip recommendations, and contextual warnings based on the calculated outcome.",
  "frontend/src/pages/Settings.tsx": "Settings page for configuring model parameters (recent form window, recency weighting, strategy mode), betting preferences (auto-sizing, do-not-bet mode, session-only mode), and data management with a reset all data option. Persists changes via mutation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, extended theme with custom animations, border radius variables, and font families. Includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state file documenting a GTA Online horse betting assistant with adaptive ML prediction engine, four-signal model (market odds, historical performance, recent form, consistency), dynamic feature weighting, and local-first architecture. Tracks 25+ existing features including dashboard stats, prediction engine, bet recommendations, race logging, and model calibration with known issue of odds input auto-filling with '1'."
}