{
  "kind": "build_request",
  "title": "Build GTA Online Betting Assistant with Adaptive Learning Engine",
  "projectName": "GTA Betting Assistant",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a Dashboard page that displays primary stats in a clean card layout: Total Races Logged, Total Bets Placed, Total Profit/Loss, Overall ROI, Overall Prediction Accuracy, Current Session Profit/Loss, and Model Calibration Score. Stats must be immediately visible and readable within 2 seconds.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "The main page should be a dashboard-style summary that shows the current state of the user's betting performance and the model's reliability",
          "These stats should be displayed in a clean card layout"
        ]
      },
      "acceptanceCriteria": [
        "Dashboard displays all 7 primary stats in card format",
        "Stats are visible immediately on page load",
        "Layout is clean and glanceable"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement Model Health Indicator on Dashboard that computes and displays confidence level (High/Medium/Low) based on recent prediction accuracy and calibration quality over the last 10-20 races. When confidence drops, the system should automatically recommend smaller bet sizes.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "The dashboard should include a clear 'Model Health' or 'Model Confidence' indicator",
          "It should be computed based on recent prediction accuracy and calibration quality"
        ]
      },
      "acceptanceCriteria": [
        "Confidence level accurately reflects recent model performance",
        "Confidence calculation uses last 10-20 races",
        "Low confidence automatically triggers reduced bet size recommendations",
        "Indicator displays as High, Medium, or Low"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Display currently selected strategy mode on Dashboard with mode name (Safe/Balanced/Value/Aggressive) and a short description of what the mode is optimizing for (e.g., 'Optimizing for highest win consistency' or 'Optimizing for maximum expected profit').",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "The main page should display the currently selected strategy mode",
          "It should also show a short description of what the mode is currently optimizing for"
        ]
      },
      "acceptanceCriteria": [
        "Current strategy mode name is displayed",
        "Strategy description updates based on selected mode",
        "Description accurately reflects mode optimization goal"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add Last Prediction Result Summary to Dashboard showing: recommended contender, assigned probability, outcome (won/placed/showed/failed), recommended bet size, and profitability result.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "The dashboard should show the last race prediction result, including: Which contender was recommended, What probability the model assigned, Whether it won, placed, showed, or failed"
        ]
      },
      "acceptanceCriteria": [
        "Last prediction displays all 5 required fields",
        "Updates immediately after race result is logged",
        "Shows clear profit/loss indication"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Create Quick Action Buttons on Dashboard: New Bet (primary call-to-action, visually prominent), Log Race Result, History, Reset Data, and Settings. New Bet button must stand out the most.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "The dashboard should include large, obvious buttons: New Bet, Log Race Result, History, Reset Data, Settings",
          "The New Bet button should be the main call-to-action and should stand out the most"
        ]
      },
      "acceptanceCriteria": [
        "All 5 buttons are clearly visible",
        "New Bet button has visual prominence",
        "Buttons navigate to correct pages"
      ]
    },
    {
      "id": "REQ-6",
      "text": "Create New Bet page with exactly 6 contender input rows labeled #1 through #6. Each row must have a numeric input box accepting values 1-30 (numerator) with static '/1' text displayed immediately to the right, forming visual odds like '[ 5 ] /1'. Inputs must be fast and simple with no extra menus or dropdowns.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "When the user opens the New Bet page, it should show exactly six rows, labeled clearly: #1, #2, #3, #4, #5, #6",
          "A numeric input box where the user can type a number from 1 to 30",
          "Immediately to the right of the input box should be static text showing the fraction denominator: /1"
        ]
      },
      "acceptanceCriteria": [
        "Page displays exactly 6 labeled contender rows",
        "Each input accepts only numbers 1-30",
        "Visual format shows '[ n ] /1' pattern",
        "Invalid values (0, negative, >30) are rejected or clamped"
      ]
    },
    {
      "id": "REQ-7",
      "text": "Implement real-time implied win probability calculation and display for each contender on New Bet page. As the user types each odds numerator, instantly compute and show implied win percentage (e.g., '5/1' displays 'Implied Win Chance: 16.67%'). Updates must happen in real time while typing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "As the user types each odds numerator, the app should instantly compute and display the implied win probability next to it",
          "This should update in real time while typing"
        ]
      },
      "acceptanceCriteria": [
        "Implied probability displays next to each odds input",
        "Calculation updates instantly as user types",
        "Probability formula is mathematically correct",
        "Display shows percentage with 2 decimal places"
      ]
    },
    {
      "id": "REQ-8",
      "text": "Add Live Odds Table Summary panel below the 6 contender rows on New Bet page displaying: total implied probabilities across all contenders, overround percentage (if total exceeds 100%), and warning if total implied probability is abnormally high or low.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Below the six rows, the app should show a small summary panel with: Total implied probabilities across all six contenders, Overround (if total implied exceeds 100%), A warning if the total implied probability is abnormally high or low"
        ]
      },
      "acceptanceCriteria": [
        "Summary panel displays total implied probability",
        "Overround is calculated and shown when >100%",
        "Warning triggers for abnormal totals",
        "Panel updates in real time with odds changes"
      ]
    },
    {
      "id": "REQ-9",
      "text": "Implement Strategy Mode Selector on New Bet page with 4 modes: Safe Mode (prioritizes highest win likelihood), Balanced Mode (balances probability and value), Value Mode (prioritizes expected value and underdog opportunities), and Aggressive Mode (maximizes payout potential). Selector should be a clear dropdown or segmented button control.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "The New Bet page should include a strategy mode selector. It should be a clear dropdown or segmented button selector with at least four modes: Safe Mode, Balanced Mode, Value Mode, Aggressive Mode"
        ]
      },
      "acceptanceCriteria": [
        "Selector displays all 4 modes",
        "Each mode has clear description of optimization goal",
        "Selected mode visibly affects recommendation logic",
        "UI clearly indicates current selection"
      ]
    },
    {
      "id": "REQ-10",
      "text": "Create prediction engine backend that validates all 6 odds are filled, computes implied probabilities, retrieves historical stats for each contender, computes model signals (Market Odds, Historical Performance, Recent Form, Consistency/Variance), applies current feature weights, generates final predicted win probabilities, selects best recommendation based on strategy mode, and calculates bet size between 1,000-10,000.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "When pressed, the app should do the following: Validate that all six odds are filled in, Compute the implied probability of each contender from the odds, Retrieve historical stats for each contender from stored race history, Compute model signals for each contender, Apply current feature weights"
        ]
      },
      "acceptanceCriteria": [
        "Engine validates all odds inputs before processing",
        "Computes all 4 model signals correctly",
        "Feature weights are applied to signals",
        "Recommendation varies based on selected strategy mode",
        "Bet size respects 1k-10k range and GTA constraints"
      ]
    },
    {
      "id": "REQ-11",
      "text": "Display prediction results on New Bet page showing: Recommended Contender (e.g., '#3'), Predicted Win Probability (e.g., '28.4%'), Implied Odds Probability (e.g., '16.7%'), Value Edge (e.g., '+11.7%'), Confidence Level (Low/Medium/High based on contender consistency and model calibration), and Recommended Bet Size in $1k increments (e.g., '$7,000').",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "After calculation, the app should show a clean results section. It should display: Recommended Contender, Predicted Win Probability, Implied Odds Probability, Edge (Value Advantage), Confidence Level, Recommended Bet Size"
        ]
      },
      "acceptanceCriteria": [
        "All 6 prediction output fields display clearly",
        "Value Edge calculation is accurate",
        "Confidence level reflects model state",
        "Bet size is in correct increments",
        "Results update after Calculate Best Bet button press"
      ]
    },
    {
      "id": "REQ-12",
      "text": "Add 'Reasoning' panel to prediction output showing breakdown of the 4 model signals with their scores and current trust weights: Market Odds Signal (score + weight), Historical Performance Signal (score + weight), Recent Form Signal (score + weight), and Consistency/Variance Signal (score + weight). Display format example: 'Market Odds: +0.21' with 'Market Odds Weight: 0.30'.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Under the prediction output, the app should show a 'Reasoning' panel that breaks down the decision into the four major signals",
          "Each should show a score like: Market Odds: +0.21",
          "And it should also show the current trust weight being applied: Market Odds Weight: 0.30"
        ]
      },
      "acceptanceCriteria": [
        "Panel displays all 4 signals with scores",
        "Each signal shows its current trust weight",
        "Scores and weights are mathematically consistent with prediction",
        "Display is clear and transparent"
      ]
    },
    {
      "id": "REQ-13",
      "text": "Implement 'Do Not Bet' safeguard logic that automatically recommends skipping a race when no contender has a strong enough edge over implied probability. Display message: 'Recommendation: Skip This Race' with explanation 'No contender shows a strong positive expected value.'",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "The app should include an automatic safeguard where it can recommend skipping a race entirely",
          "If no contender has a strong enough edge over its implied probability, the app should display: Recommendation: Skip This Race"
        ]
      },
      "acceptanceCriteria": [
        "System detects races with insufficient edge",
        "Skip recommendation displays clearly",
        "Logic prevents betting when expected value is negative or marginal",
        "Recommendation includes explanatory text"
      ]
    },
    {
      "id": "REQ-14",
      "text": "Implement intelligent bet sizing that adjusts based on edge strength, model confidence, contender variance rating, and recent model performance. When model confidence is low, automatically recommend smaller bets even if edge appears large.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "The bet sizing should be determined by: edge strength, model confidence, contender variance rating, recent model performance",
          "If the model confidence is low, the app should automatically recommend smaller bets even if the edge looks large"
        ]
      },
      "acceptanceCriteria": [
        "Bet size scales with edge strength",
        "Low model confidence reduces bet size",
        "High variance contenders trigger conservative sizing",
        "Recent poor performance reduces bet amounts"
      ]
    },
    {
      "id": "REQ-15",
      "text": "Create Race Result Logging page with quick input controls (dropdowns or tap buttons, not typing) for Winner (#1-#6), Second Place (#1-#6), and Third Place (#1-#6). Store race data including: odds entered, timestamp, finishing order, model prediction, recommended bet size, and optional toggle for whether user followed recommendation.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "This page should allow the user to input: Winner (#1–#6), Second place (#1–#6), Third place (#1–#6)",
          "This should ideally be done with quick dropdowns or tap buttons, not typing",
          "When saved, the app should store: the odds entered, the timestamp, the finishing order"
        ]
      },
      "acceptanceCriteria": [
        "Page uses dropdowns or buttons for quick input",
        "All 3 finishing positions are captured",
        "Race data includes all 6 specified fields",
        "Optional toggle for user follow-through is present",
        "Save action triggers model update"
      ]
    },
    {
      "id": "REQ-16",
      "text": "Implement adaptive learning system in backend that updates feature weights after each race save based on prediction performance. If predicted probability matches outcome, strengthen supporting signals; if prediction fails repeatedly, reduce confidence in those signals. Track model calibration by comparing predicted vs actual outcomes over many races and recalibrate when predictions are consistently overconfident or underconfident.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "When a race is saved, the model should update itself. It should adjust its internal feature weights based on performance",
          "The app should track model calibration by comparing predicted probability vs actual outcomes across many races"
        ]
      },
      "acceptanceCriteria": [
        "Feature weights update after each race save",
        "Weights increase when predictions are accurate",
        "Weights decrease when predictions fail repeatedly",
        "Model calibration tracks predicted vs actual over time",
        "System recalibrates when consistently over/under confident"
      ]
    },
    {
      "id": "REQ-17",
      "text": "Implement contender-level consistency scoring system that tracks variance and unpredictability. High-variance contenders should trigger reduced confidence and smaller bet sizes even when other signals are favorable.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "The model should also maintain contender-level consistency scores. If a contender has high variance and unpredictable results, it should reduce confidence and reduce bet sizing even if other signals are favorable"
        ]
      },
      "acceptanceCriteria": [
        "Each contender has tracked consistency score",
        "High variance is detected and scored",
        "High variance reduces confidence ratings",
        "High variance triggers smaller bet sizes"
      ]
    },
    {
      "id": "REQ-18",
      "text": "Implement recency weighting system where recent races matter more than older races in model calculations. This allows the model to adapt if game RNG behavior changes in current session.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "The model should also use recency weighting, meaning the most recent races should matter more than races from long ago. This allows the model to adapt if the game's RNG behavior feels different in the current session"
        ]
      },
      "acceptanceCriteria": [
        "Recent races have higher weight in calculations",
        "Weight decreases with race age",
        "Model adapts to session-specific patterns",
        "Recency strength is configurable"
      ]
    },
    {
      "id": "REQ-19",
      "text": "Create History page displaying scrollable list of logged races. Each entry shows: timestamp, odds for all 6 contenders, top 3 finishers, model recommended contender, recommended bet size, correctness indicator, and profit/loss result. Include optional JSON or CSV export functionality.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "The app should have a history page that shows logged races in a scrollable list. Each entry should show: timestamp, odds for each contender, top 3 finishers, model recommended contender, recommended bet size, whether it was correct, profit/loss result",
          "This page should also allow exporting history as JSON or CSV"
        ]
      },
      "acceptanceCriteria": [
        "History displays all races in scrollable list",
        "Each entry shows all 7 specified data points",
        "List is sorted by timestamp (newest first)",
        "Export to JSON or CSV is functional"
      ]
    },
    {
      "id": "REQ-20",
      "text": "Create Contender Statistics page showing computed stats for each contender #1-#6: win/place/show rate, last 5 finishes, streak status, average implied odds, optional overperformance vs odds metric, and consistency score. Display as individual contender profiles.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "The app should include a page that shows the computed stats for each contender (#1–#6): win/place/show rate, last 5 finishes, streak status, average implied odds, overperformance vs odds, consistency score"
        ]
      },
      "acceptanceCriteria": [
        "Page displays stats for all 6 contenders",
        "Each contender shows all 6 specified metrics",
        "Data updates after each race save",
        "Stats feel like individual profiles"
      ]
    },
    {
      "id": "REQ-21",
      "text": "Create Settings page with controls for: reset all data, change recent-form window size (default 5 races), adjust recency weighting strength, toggle 'Do Not Bet' mode on/off, toggle auto bet sizing on/off, set default strategy mode, and enable session-only mode vs lifetime mode.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "The app should include a settings page where the user can: reset all data, change recent-form window size (default 5), change recency weighting strength, toggle 'Do Not Bet' mode on/off, toggle auto bet sizing on/off, set default strategy mode, enable 'session-only mode' vs lifetime mode"
        ]
      },
      "acceptanceCriteria": [
        "All 7 settings controls are present",
        "Reset data clears all stored history",
        "Window size default is 5",
        "Each toggle functions correctly",
        "Settings persist across sessions"
      ]
    },
    {
      "id": "REQ-22",
      "text": "Implement local persistent storage system that saves all race history, model state, feature weights, and contender statistics on-device. Data must persist when app is closed and reopened. Include ability to reset all data via Settings.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "The app should store all history locally on-device so that the user never loses progress, even if they close the app",
          "It should also be able to reset all stored data if the user chooses to start fresh"
        ]
      },
      "acceptanceCriteria": [
        "All race data persists on-device",
        "Model state persists across sessions",
        "Feature weights are saved and loaded",
        "Contender stats persist",
        "Reset functionality clears all data completely"
      ]
    },
    {
      "id": "REQ-23",
      "text": "Display contextual warnings and guidance messages throughout the app: 'Model confidence low: bet size reduced.', 'High variance contender: risk increased.', 'No value detected: skipping recommended.' Messages should appear when conditions are met.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "The app should display warnings and guidance like: 'Model confidence low: bet size reduced.', 'High variance contender: risk increased.', 'No value detected: skipping recommended.'"
        ]
      },
      "acceptanceCriteria": [
        "All 3 warning types display when triggered",
        "Messages are contextually accurate",
        "Warnings are visible and non-intrusive",
        "Multiple warnings can display simultaneously"
      ]
    },
    {
      "id": "REQ-24",
      "text": "Implement session summary display that appears after every 10 or 20 races showing: profit/loss, best-performing contender, worst-performing contender, most accurate strategy mode, most profitable strategy mode, and current model trust weights.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "It should also show a clean session summary after every 10 or 20 races, including: profit/loss, best-performing contender, worst-performing contender, most accurate strategy mode, most profitable strategy mode, current model trust weights"
        ]
      },
      "acceptanceCriteria": [
        "Summary triggers at 10 or 20 race intervals",
        "All 6 specified metrics are displayed",
        "Summary is clean and readable",
        "Display creates sense of progress"
      ]
    },
    {
      "id": "REQ-25",
      "text": "Design the app with a clean, fast, minimalist visual aesthetic optimized for professional betting analysis. Use a dark or neutral color scheme with high-contrast typography for instant readability. Avoid blue and purple unless they serve a functional purpose. Every screen must be glanceable with the most important numbers immediately visible.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "This app should be designed as a clean, fast, no-nonsense betting assistant",
          "The interface should be optimized for speed, clarity, and minimal user effort. Every screen should be readable at a glance, with the most important numbers visible immediately"
        ]
      },
      "acceptanceCriteria": [
        "Visual design is clean and minimal",
        "Color scheme supports professional analysis feel",
        "Typography is high-contrast and readable",
        "Key numbers are immediately visible on each screen",
        "Design conveys speed and precision"
      ]
    }
  ],
  "constraints": [
    "All race history and model state must persist locally on-device using browser storage",
    "Bet sizing must respect GTA Online constraints: minimum 1,000, maximum 10,000, increments of 1,000",
    "Odds input must be restricted to numerators 1-30 with fixed denominator of 1",
    "All races use exactly 6 contenders numbered #1-#6",
    "Strategy mode selection must visibly affect recommendation logic",
    "Model must use exactly 4 signals: Market Odds, Historical Performance, Recent Form, Consistency/Variance"
  ],
  "nonGoals": [
    "Integration with GTA Online game client or API",
    "Real-time race data import or automation",
    "Multi-user or social features",
    "External database or cloud sync",
    "Complex charting or visualization beyond required stats",
    "Support for betting systems other than GTA Online horse racing"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}