{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "GTA Betting Assistant Frontend Implementation Plan",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Create Dashboard page displaying 7 primary stats in clean card layout with 2-second load time",
      "acceptanceCriteria": [
        "Dashboard displays all 7 primary stats in card format",
        "Stats are visible immediately on page load",
        "Layout is clean and glanceable"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "create",
          "description": "Create Dashboard page component displaying Total Races Logged, Total Bets Placed, Total Profit/Loss, Overall ROI, Overall Prediction Accuracy, Current Session Profit/Loss, and Model Calibration Score in a card-based layout using shadcn/ui Card components. Fetch data from backend using getRaceHistory and getModelStats methods. Ensure stats render within 2 seconds by optimizing data fetching and display logic."
        },
        {
          "path": "frontend/src/components/StatCard.tsx",
          "operation": "create",
          "description": "Create reusable StatCard component using shadcn/ui Card that accepts title, value, and optional subtitle props. Ensure high-contrast typography for instant readability with large, prominent value display."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement Model Health Indicator computing confidence level from recent prediction accuracy and calibration",
      "acceptanceCriteria": [
        "Confidence level accurately reflects recent model performance",
        "Confidence calculation uses last 10-20 races",
        "Low confidence automatically triggers reduced bet size recommendations",
        "Indicator displays as High, Medium, or Low"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ModelHealthIndicator.tsx",
          "operation": "create",
          "description": "Create ModelHealthIndicator component that fetches ModelStats from backend using getModelStats method. Display confidence level (High/Medium/Low) based on recentAccuracy and calibration fields. Calculate confidence from last 10-20 races using getRaceHistory. Include visual indicator (colored badge or status icon) and explanatory text. When confidence is low, display recommendation to reduce bet sizes."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Integrate ModelHealthIndicator component into Dashboard page layout, positioning it prominently near the top stats section."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Display currently selected strategy mode on Dashboard with name and optimization description",
      "acceptanceCriteria": [
        "Current strategy mode name is displayed",
        "Strategy description updates based on selected mode",
        "Description accurately reflects mode optimization goal"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/StrategyModeDisplay.tsx",
          "operation": "create",
          "description": "Create StrategyModeDisplay component that fetches current strategyMode from backend using getUserSettings method. Display mode name (Safe/Balanced/Value/Aggressive) and corresponding optimization description. Map each mode to its description: Safe='Optimizing for highest win consistency', Balanced='Balancing probability and value', Value='Prioritizing expected value and underdog opportunities', Aggressive='Maximizing payout potential'."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Add StrategyModeDisplay component to Dashboard page, positioning it in a visible location below the primary stats cards."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add Last Prediction Result Summary to Dashboard showing 5 key fields",
      "acceptanceCriteria": [
        "Last prediction displays all 5 required fields",
        "Updates immediately after race result is logged",
        "Shows clear profit/loss indication"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LastPredictionSummary.tsx",
          "operation": "create",
          "description": "Create LastPredictionSummary component that fetches race history using getRaceHistory and displays the most recent entry. Show: recommended contender (#1-#6), assigned probability (from modelPrediction), outcome status (won/placed/showed/failed based on RaceOutcome), recommended bet size (from betSize field), and profit/loss result. Calculate profit based on outcome and odds. Use color coding for profit (green) and loss (red)."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Add LastPredictionSummary component to Dashboard page below the strategy mode display section."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Create Quick Action Buttons on Dashboard with New Bet as primary CTA",
      "acceptanceCriteria": [
        "All 5 buttons are clearly visible",
        "New Bet button has visual prominence",
        "Buttons navigate to correct pages"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/QuickActionButtons.tsx",
          "operation": "create",
          "description": "Create QuickActionButtons component with 5 buttons: New Bet (primary, visually prominent using shadcn/ui Button variant='default' and larger size), Log Race Result, History, Reset Data, and Settings. Use React Router navigation (useNavigate hook) to route to /new-bet, /log-result, /history, and /settings pages. Reset Data should trigger confirmation dialog before calling backend resetData method."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Add QuickActionButtons component to Dashboard page, positioning it prominently below the last prediction summary for easy access."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Create New Bet page with 6 contender input rows accepting odds numerators 1-30",
      "acceptanceCriteria": [
        "Page displays exactly 6 labeled contender rows",
        "Each input accepts only numbers 1-30",
        "Visual format shows '[ n ] /1' pattern",
        "Invalid values (0, negative, >30) are rejected or clamped"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/NewBet.tsx",
          "operation": "create",
          "description": "Create NewBet page component with exactly 6 contender rows labeled #1 through #6. Each row contains a numeric input (using shadcn/ui Input component) that accepts values 1-30, followed by static text '/1'. Implement validation to reject or clamp values outside 1-30 range. Use controlled inputs with state management. Display visual format as '[ n ] /1' where n is the user-entered numerator."
        },
        {
          "path": "frontend/src/components/ContenderOddsRow.tsx",
          "operation": "create",
          "description": "Create reusable ContenderOddsRow component accepting contender number, odds value, and onChange handler props. Display contender label, numeric input, and '/1' text. Implement input validation for 1-30 range with visual feedback for invalid entries."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Implement real-time implied win probability calculation and display for each contender",
      "acceptanceCriteria": [
        "Implied probability displays next to each odds input",
        "Calculation updates instantly as user types",
        "Probability formula is mathematically correct",
        "Display shows percentage with 2 decimal places"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ContenderOddsRow.tsx",
          "operation": "modify",
          "description": "Add real-time implied win probability calculation to ContenderOddsRow component. Calculate implied probability as 1 / (odds + 1) * 100 and display as percentage with 2 decimal places (e.g., '5/1' shows 'Implied Win Chance: 16.67%'). Update calculation instantly on input change using useEffect or derived state."
        },
        {
          "path": "frontend/src/lib/betting-calculations.ts",
          "operation": "create",
          "description": "Create utility module with betting calculation functions including calculateImpliedProbability(odds: number): number that implements formula: 1 / (odds + 1) * 100. Ensure mathematical accuracy and handle edge cases."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Add Live Odds Table Summary panel showing total implied probabilities and overround",
      "acceptanceCriteria": [
        "Summary panel displays total implied probability",
        "Overround is calculated and shown when >100%",
        "Warning triggers for abnormal totals",
        "Panel updates in real time with odds changes"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/OddsSummaryPanel.tsx",
          "operation": "create",
          "description": "Create OddsSummaryPanel component that accepts array of 6 odds values as props. Calculate total implied probability by summing individual implied probabilities. Display total percentage. When total exceeds 100%, calculate and display overround percentage. Show warning message if total is abnormally high (>150%) or low (<80%). Update calculations in real time as odds values change."
        },
        {
          "path": "frontend/src/pages/NewBet.tsx",
          "operation": "modify",
          "description": "Add OddsSummaryPanel component to NewBet page below the 6 contender rows. Pass current odds state array as prop to enable real-time updates."
        },
        {
          "path": "frontend/src/lib/betting-calculations.ts",
          "operation": "modify",
          "description": "Add calculateTotalImpliedProbability(oddsArray: number[]): number and calculateOverround(totalImplied: number): number functions to support odds summary calculations."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Implement Strategy Mode Selector on New Bet page with 4 modes",
      "acceptanceCriteria": [
        "Selector displays all 4 modes",
        "Each mode has clear description of optimization goal",
        "Selected mode visibly affects recommendation logic",
        "UI clearly indicates current selection"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/StrategyModeSelector.tsx",
          "operation": "create",
          "description": "Create StrategyModeSelector component using shadcn/ui Select or RadioGroup component. Display 4 modes: Safe Mode, Balanced Mode, Value Mode, and Aggressive Mode. Include optimization description for each mode. Fetch current selection from backend using getUserSettings. Update backend when user changes mode using updateUserSettings. Ensure selected mode is visually distinct."
        },
        {
          "path": "frontend/src/pages/NewBet.tsx",
          "operation": "modify",
          "description": "Add StrategyModeSelector component to NewBet page, positioning it prominently above or below the contender odds input section. Ensure selected mode is used when calculating predictions."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Display prediction results showing 6 key output fields including recommended contender and confidence",
      "acceptanceCriteria": [
        "All 6 prediction output fields display clearly",
        "Value Edge calculation is accurate",
        "Confidence level reflects model state",
        "Bet size is in correct increments",
        "Results update after Calculate Best Bet button press"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PredictionResults.tsx",
          "operation": "create",
          "description": "Create PredictionResults component displaying: Recommended Contender (#1-#6), Predicted Win Probability (percentage), Implied Odds Probability (percentage), Value Edge (difference, shown as percentage with + or -), Confidence Level (Low/Medium/High from ModelStats), and Recommended Bet Size (in $1,000 increments formatted as currency). Use card or panel layout with clear typography and color coding for positive/negative edge."
        },
        {
          "path": "frontend/src/pages/NewBet.tsx",
          "operation": "modify",
          "description": "Add PredictionResults component to NewBet page below the odds summary panel. Add 'Calculate Best Bet' button that triggers prediction calculation (calls backend prediction logic via stored race history analysis). Show/hide results based on whether calculation has been performed. Ensure results update when button is pressed."
        },
        {
          "path": "frontend/src/hooks/usePrediction.ts",
          "operation": "create",
          "description": "Create custom React hook usePrediction that manages prediction state and calculation logic. Accept odds array and strategy mode as inputs. Return prediction result object with all 6 required fields. Integrate with backend methods (getRaceHistory, getModelStats) to support prediction calculations on frontend."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Add Reasoning panel showing 4 model signals with scores and trust weights",
      "acceptanceCriteria": [
        "Panel displays all 4 signals with scores",
        "Each signal shows its current trust weight",
        "Scores and weights are mathematically consistent with prediction",
        "Display is clear and transparent"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ReasoningPanel.tsx",
          "operation": "create",
          "description": "Create ReasoningPanel component displaying breakdown of 4 model signals: Market Odds Signal, Historical Performance Signal, Recent Form Signal, and Consistency/Variance Signal. For each signal, show score value (e.g., '+0.21') and current trust weight (e.g., '0.30'). Format as clear list or grid layout. Accept signal data as props from prediction calculation."
        },
        {
          "path": "frontend/src/pages/NewBet.tsx",
          "operation": "modify",
          "description": "Add ReasoningPanel component to NewBet page immediately below PredictionResults. Pass signal breakdown data from prediction calculation results. Show/hide panel in sync with prediction results."
        },
        {
          "path": "frontend/src/hooks/usePrediction.ts",
          "operation": "modify",
          "description": "Extend usePrediction hook to return signal breakdown data including scores and weights for all 4 signals (Market Odds, Historical Performance, Recent Form, Consistency/Variance) to support ReasoningPanel display."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Implement Do Not Bet safeguard logic with skip race recommendation",
      "acceptanceCriteria": [
        "System detects races with insufficient edge",
        "Skip recommendation displays clearly",
        "Logic prevents betting when expected value is negative or marginal",
        "Recommendation includes explanatory text"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SkipRaceRecommendation.tsx",
          "operation": "create",
          "description": "Create SkipRaceRecommendation component displaying 'Recommendation: Skip This Race' message with explanation 'No contender shows a strong positive expected value.' Use alert or warning card styling. Accept shouldSkip boolean prop from prediction logic."
        },
        {
          "path": "frontend/src/pages/NewBet.tsx",
          "operation": "modify",
          "description": "Add SkipRaceRecommendation component to NewBet page. Show component when prediction calculation determines no contender has sufficient edge over implied probability. Hide PredictionResults when skip is recommended."
        },
        {
          "path": "frontend/src/hooks/usePrediction.ts",
          "operation": "modify",
          "description": "Add skip race logic to usePrediction hook. Calculate expected value for each contender. When no contender exceeds minimum edge threshold, set shouldSkip flag to true in prediction result. Ensure safeguard logic runs automatically during prediction calculation."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Create Race Result Logging page with quick input controls for finishing positions",
      "acceptanceCriteria": [
        "Page uses dropdowns or buttons for quick input",
        "All 3 finishing positions are captured",
        "Race data includes all 6 specified fields",
        "Optional toggle for user follow-through is present",
        "Save action triggers model update"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LogRaceResult.tsx",
          "operation": "create",
          "description": "Create LogRaceResult page with quick input controls (shadcn/ui Select dropdowns or button groups) for Winner (#1-#6), Second Place (#1-#6), and Third Place (#1-#6). Include optional toggle for 'Did you follow the recommendation?'. On save, call backend updateRaceOutcome method with finishing positions and logRaceEntry with all race data (odds, timestamp, finishing order, modelPrediction, betSize, followedRecommendation). Show success confirmation after save."
        },
        {
          "path": "frontend/src/components/FinishingPositionSelector.tsx",
          "operation": "create",
          "description": "Create reusable FinishingPositionSelector component using shadcn/ui Select that accepts position label (Winner/Second/Third) and selection handler. Display options #1 through #6. Ensure quick tap/click interaction without typing."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Create History page displaying scrollable list of logged races with export functionality",
      "acceptanceCriteria": [
        "History displays all races in scrollable list",
        "Each entry shows all 7 specified data points",
        "List is sorted by timestamp (newest first)",
        "Export to JSON or CSV is functional"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/History.tsx",
          "operation": "create",
          "description": "Create History page displaying scrollable list of logged races fetched using getRaceHistory backend method. Each entry shows: timestamp, odds for all 6 contenders, top 3 finishers, model recommended contender, recommended bet size, correctness indicator (won/placed/showed/failed), and profit/loss result. Sort entries by timestamp descending (newest first). Include export buttons for JSON and CSV formats using browser download functionality."
        },
        {
          "path": "frontend/src/components/RaceHistoryEntry.tsx",
          "operation": "create",
          "description": "Create RaceHistoryEntry component displaying single race record with all 7 required data points in card or list item format. Accept RaceEntry object as prop. Format timestamp as readable date/time. Display profit/loss with color coding (green for profit, red for loss)."
        },
        {
          "path": "frontend/src/lib/export-utils.ts",
          "operation": "create",
          "description": "Create export utility module with functions to convert race history data to JSON and CSV formats. Implement downloadAsJSON(data: RaceEntry[], filename: string) and downloadAsCSV(data: RaceEntry[], filename: string) functions using browser Blob and download link mechanisms."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Create Contender Statistics page showing computed stats for each contender",
      "acceptanceCriteria": [
        "Page displays stats for all 6 contenders",
        "Each contender shows all 6 specified metrics",
        "Data updates after each race save",
        "Stats feel like individual profiles"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ContenderStats.tsx",
          "operation": "create",
          "description": "Create ContenderStats page displaying individual profiles for contenders #1-#6. For each contender, calculate and show: win/place/show rate, last 5 finishes, streak status, average implied odds, overperformance vs odds metric, and consistency score. Fetch race history using getRaceHistory and compute stats on frontend. Use card-based layout for each contender profile."
        },
        {
          "path": "frontend/src/components/ContenderProfile.tsx",
          "operation": "create",
          "description": "Create ContenderProfile component displaying stats for a single contender. Accept contender number and computed stats as props. Show all 6 metrics (win/place/show rate, last 5 finishes, streak, avg implied odds, overperformance, consistency score) in clear, readable format using shadcn/ui Card."
        },
        {
          "path": "frontend/src/lib/contender-calculations.ts",
          "operation": "create",
          "description": "Create utility module for contender statistics calculations. Implement functions to compute win/place/show rates, detect streaks, calculate average implied odds, compute overperformance metrics, and calculate consistency scores from race history data."
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Create Settings page with 7 configuration controls",
      "acceptanceCriteria": [
        "All 7 settings controls are present",
        "Reset data clears all stored history",
        "Window size default is 5",
        "Each toggle functions correctly",
        "Settings persist across sessions"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Settings.tsx",
          "operation": "create",
          "description": "Create Settings page with 7 controls: Reset All Data button (with confirmation dialog calling backend resetData), Recent-form Window Size input (default 5, using shadcn/ui Input), Recency Weighting Strength slider or input, Do Not Bet Mode toggle (shadcn/ui Switch), Auto Bet Sizing toggle, Default Strategy Mode selector (shadcn/ui Select), and Session-only Mode vs Lifetime Mode toggle. Fetch current settings using getUserSettings and update using updateUserSettings backend methods. Show save confirmation."
        },
        {
          "path": "frontend/src/components/SettingsControl.tsx",
          "operation": "create",
          "description": "Create reusable SettingsControl component wrapper that accepts label, description, and control element as children. Provides consistent styling and layout for all settings controls."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Display contextual warnings and guidance messages throughout the app",
      "acceptanceCriteria": [
        "All 3 warning types display when triggered",
        "Messages are contextually accurate",
        "Warnings are visible and non-intrusive",
        "Multiple warnings can display simultaneously"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ContextualWarning.tsx",
          "operation": "create",
          "description": "Create ContextualWarning component using shadcn/ui Alert that displays guidance messages: 'Model confidence low: bet size reduced.', 'High variance contender: risk increased.', 'No value detected: skipping recommended.' Accept warning type and conditional display props. Use appropriate alert styling (warning/info variants)."
        },
        {
          "path": "frontend/src/pages/NewBet.tsx",
          "operation": "modify",
          "description": "Add ContextualWarning components to NewBet page that trigger based on prediction results: show low confidence warning when ModelStats.confidenceLevel is 'Low', show high variance warning when selected contender has high variance score, show no value warning when skip race is recommended. Support multiple simultaneous warnings."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Add ContextualWarning component to Dashboard that shows model confidence warning when current ModelStats indicate low confidence level."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Implement session summary display after every 10 or 20 races",
      "acceptanceCriteria": [
        "Summary triggers at 10 or 20 race intervals",
        "All 6 specified metrics are displayed",
        "Summary is clean and readable",
        "Display creates sense of progress"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SessionSummaryModal.tsx",
          "operation": "create",
          "description": "Create SessionSummaryModal component using shadcn/ui Dialog that displays after every 10 or 20 races. Show: profit/loss, best-performing contender, worst-performing contender, most accurate strategy mode, most profitable strategy mode, and current model trust weights. Calculate metrics from race history using getRaceHistory. Include dismiss button. Use clean, readable card-based layout within modal."
        },
        {
          "path": "frontend/src/hooks/useSessionTracking.ts",
          "operation": "create",
          "description": "Create useSessionTracking hook that monitors race count and triggers session summary display at 10 and 20 race intervals. Track race count using getRaceHistory length. Return showSummary flag and summary data. Reset tracking after each summary display."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Integrate useSessionTracking hook and SessionSummaryModal in App.tsx to display session summary globally at appropriate intervals regardless of current page. Ensure modal appears when race count reaches multiples of 10 or 20."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Design app with clean, fast, minimalist visual aesthetic optimized for professional betting analysis",
      "acceptanceCriteria": [
        "Visual design is clean and minimal",
        "Color scheme supports professional analysis feel",
        "Typography is high-contrast and readable",
        "Key numbers are immediately visible on each screen",
        "Design conveys speed and precision"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update global styles to implement clean, minimalist aesthetic with dark or neutral color scheme. Use high-contrast typography for instant readability. Define CSS custom properties for professional betting analysis theme (avoid blue and purple unless functional). Set base font sizes and weights to emphasize key numbers. Ensure glanceable layouts with prominent data display."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Configure Tailwind theme with custom color palette supporting dark/neutral professional betting aesthetic. Define typography scale emphasizing readability and data prominence. Set spacing scale for clean, uncluttered layouts. Configure high-contrast color combinations for profit/loss indicators and key metrics."
        },
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "create",
          "description": "Create Layout component providing consistent navigation structure and visual framework for all pages. Include header with app branding, navigation menu (Dashboard, New Bet, Log Result, History, Contender Stats, Settings), and content area. Apply minimalist styling with focus on content clarity and speed."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap all page routes with Layout component to provide consistent visual structure. Configure React Router with routes for Dashboard (/), New Bet (/new-bet), Log Race Result (/log-result), History (/history), Contender Stats (/stats), and Settings (/settings). Set Dashboard as default route."
        }
      ]
    }
  ]
}